package main

import "fmt"

func main()  {

	// ***********************************
	// ********** 練 習 問 題 *************
	// ***********************************

	fmt.Println(" 321325 * 424521 = ", 321325 * 424521);
		// 練習問題3:作業に比べて少し過度な感はあるけど、Goを計算機としても使える。
		// 321325 × 424521 を計算して、その結果をターミナルに出力するプログラムを作成しなさい。
		// 乗算のために*（掛け算）演算子を使用する。

	fmt.Println(len("日本語l"));
		// 練習問題4:文字列とは何か？ 文字列の長さを求める方法は何か？

	fmt.Println((true && true)||(false && true)||!(false && false));
		// 演習問題5: 次の数式の値は何か？ (true & & false) || (false & & true) || ! (false & & false)

}
