package main

import "fmt"

func main()  {

	// ***********************************
	// ********** 연 습 문 제 *************
	// ***********************************

	fmt.Println(" 321325 * 424521 = ", 321325 * 424521);
		// 연습문제 3 : 작업에 비해 조금 과도한 감이 있긴 하지만 Go를 계산기로도 쓸 수 있다.
		// 321325 × 424521를 계산해서 그 결과를 터미널에 출력하는 프로그램을 작성하라. (곱셈을 위해 * 연산자를 사용한다)

	fmt.Println(len("日本語l"));
		// 연습문제 4 : 문자열이란 무엇인가? 문자열의 길이를 구하는 방법은 무엇인가?

	fmt.Println((true && true)||(false && true)||!(false && false));
		// 연습문제 5 : 다음 수식의 값은 무엇인가? (true && false) || (false && true) || !(false && false)

}
